#--------------------------------------------------------------------------------------#
##############################
# Блок підключення бібліотек #
##############################
# -*- coding: utf-8 -*-
import sys

##############################
#        Кінець блоку        #
#    підключення бібліотек   #
##############################
#______________________________________________________________________________________#


#--------------------------------------------------------------------------------------#
###########################
# Блок реалізації функцій #
###########################
def print_hello():
    print("Hello")
#ФіззБаз
def fizzbuzz(fizz=0, buzz=0, count=0):
    #Використання рядку у ФізБаз
    result = ""
    if (count):
        if (fizz < 0):
            fizz * -1
        if (buzz < 0):
            buzz * -1
        for i in range(1, count + 1):
            if (not i % fizz):
                result += "F"
            if (not i % buzz):
                result += "B"
            if i % fizz and i % buzz:
                result += str(i)
            result += " "
    return result
###########################
#       Кінець блоку      #
#    реалізації функцій   #
###########################
#______________________________________________________________________________________#


#--------------------------------------------------------------------------------------#
#################################
# Основний цикл роботи програми #
#################################
while True:
    print("Введи номер завдання. От 1 до 3. Введи 0 чтобы выйти. ")
    your_choice = int(input())
    print(f"Вы ввели: {str(your_choice)}")
    if(your_choice):
        print(f"Завдання №{your_choice}")
    match (your_choice):
        case 1:
            print("ФізБаз з рядками")
            fizz = int(input("Введіть число fizz: "))
            bazz = int(input("Введіть число bazz: "))
            count = int(input("Введіть число count: "))
            print(fizzbuzz(fizz,bazz,count))
        case 2:
            print("")

        case 0:
            break
        case _:
            print("Ваш выбор не входит в диапазон")
    print("\n")
    if (not your_choice):
        break
print("\nПрограма закінчила роботу. До зустрічі!\n")

#################################
#         Кінець роботи         #
#    основного циклу програми   #
#################################
#______________________________________________________________________________________#