#--------------------------------------------------------------------------------------#
##############################
# Блок підключення бібліотек #
##############################
# -*- coding: utf-8 -*-
import sys

##############################
#        Кінець блоку        #
#    підключення бібліотек   #
##############################
#______________________________________________________________________________________#


#--------------------------------------------------------------------------------------#
###########################
# Блок реалізації функцій #
###########################
def nt_smpl_prcents(start_sum = 1000, percents = 15, count_month = 24):
    if start_sum and percents and count_month:
        return start_sum * (1+ (percents / 100) / 12) ** count_month
    return 0
###########################
#       Кінець блоку      #
#    реалізації функцій   #
###########################
#______________________________________________________________________________________#


#--------------------------------------------------------------------------------------#
#################################
# Основний цикл роботи програми #
#################################
while True:
    print("Введи номер завдання 1. Введи 0 чтобы выйти. ")
    your_choice = int(input())
    print(f"Вы ввели: {str(your_choice)}")
    if(your_choice):
        print(f"Завдання №{your_choice}")
    match (your_choice):
        case 1:
            print("Сложные проценты")
            strt_sm = float(input("Start sum: "))
            prcnts = float(input("Percents: "))
            cnt_mnts = int(input("Count months: "))
            summ = nt_smpl_prcents(strt_sm, prcnts, cnt_mnts)
            print(f"Накопление от процентов составит: {summ - strt_sm}")
            print(f"Сумма составит: {summ}")
        case 0:
            break
        case _:
            print("Ваш выбор не входит в диапазон")
    print("\n")
    if (not your_choice):
        break
print("\nПрограма закінчила роботу. До зустрічі!\n")

#################################
#         Кінець роботи         #
#    основного циклу програми   #
#################################
#______________________________________________________________________________________#